---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnPanelBoard
source: html/b09bd004-0bba-75e6-64e9-2a393fc76fce.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnPanelBoard Property

Need to replace spare or space on panelboard.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReplaceSpareSpaceOnPanelBoard { get; }
```